# Import libraries

Import libraries

In [89]:
import numpy as np
import pandas as pd

import os

from datetime import timedelta

Create directory to 'data' folder

In [90]:
loc = os.path.normpath(os.getcwd() + os.sep + os.pardir)
data_loc = loc + r'\data'

# Order

## Inspect data

Import data file

In [91]:
order_df = pd.read_csv(data_loc + r"\olist_orders_dataset.csv")
order_df.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13 00:00:00
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04 00:00:00
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15 00:00:00
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26 00:00:00

Overall information

In [92]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   order_id                       99441 non-null  object
 1   customer_id                    99441 non-null  object
 2   order_status                   99441 non-null  object
 3   order_purchase_timestamp       99441 non-null  object
 4   order_approved_at              99281 non-null  object
 5   order_delivered_carrier_date   97658 non-null  object
 6   order_delivered_customer_date  96476 non-null  object
 7   order_estimated_delivery_date  99441 non-null  object
dtypes: object(8)
memory usage: 6.1+ MB

Primary key is the 'order_id' column

In [93]:
order_df['order_id'].unique().size

99441

Description of each column (assumptions)

<table>
  <thead>
    <tr>
      <th>Column Name</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>order_id</td>
      <td>Unique identifier for each order</td>
    </tr>
    <tr>
      <td>customer_id</td>
      <td>Foreign key to link to customer table</td>
    </tr>
    <tr>
      <td>order_status</td>
      <td>Status of the order</td>
    </tr>
    <tr>
      <td>order_purchase_timestamp </td>
      <td>The time at which the order is created</td>
    </tr>
    <tr>
      <td>order_approved_at </td>
      <td>The time at which the order is approved</td>
    </tr>
    <tr>
      <td>order_delivered_carrier_date</td>
      <td>The time at which the order is delivered</td>
    </tr>
    <tr>
      <td>order_delivered_customer_date</td>
      <td>The time at which the order arrives</td>
    </tr>
    <tr>
      <td>order_estimated_delivery_date</td>
      <td>The time at which the order is estimated to arrive</td>
    </tr>
  </tbody>
</table>

## Clean data

Fill in all the missing values in date columns by adding the average time period to the previous timestamps

In [94]:
# Define function
def time_add(df, col1, col2):
    """
    Input:
    df: dataframe
    col1: datetime column of the previous timestamp
    col2: datetime column with missing data of consequent timestamp
    
    Output:
    new_col: column with average time added to the previous timestamp
    
    """
    # Convert to datetime
    df1 = pd.to_datetime(df[col1])
    df2 = pd.to_datetime(df[col2])

    # Get the average time delta in seconds
    avg_time = (df2-df1).mean().seconds
    
    new_col = df1.apply(lambda x: x + timedelta(seconds=avg_time))
    
    return new_col

In [95]:
# Fill in the missing value
order_df_cols = order_df.columns

for col1,col2 in zip(order_df_cols[3:-2], order_df_cols[4:-1]):
    new_col = time_add(order_df, col1, col2)
    order_df[col2] = order_df[col2].fillna(new_col)

# Customer

## Inspect data

Import data file

In [96]:
customer_df = pd.read_csv(data_loc + r"\olist_customers_dataset.csv")
customer_df

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP
...,...,...,...,...,...
99436,17ddf5dd5d51696bb3d7c6291687be6f,1a29b476fee25c95fbafc67c5ac95cf8,3937,sao paulo,SP
99437,e7b71a9017aa05c9a7fd292d714858e8,d52a67c98be1cf6a5c84435bd38d095d,6764,taboao da serra,SP
99438,5e28dfe12db7fb50a4b2f691faecea5e,e9f50caf99f032f0bf3c55141f019d99,60115,fortaleza,CE
99439,56b18e2166679b8a959d72dd06da27f9,73c2643a0a458b49f58cea58833b192e,92120,canoas,RS
99440,274fa6071e5e17fe303b9748641082c8,84732c5050c01db9b23e19ba39899398,6703,cotia,SP

Overall information

In [97]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  int64
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

Two columns 'customer_id' and 'customer_unique_id' can be confusing. We assume a fact table containing both order and customer information was splitted into two and they are linked by the 'customer_id' column and 'customer_unique_id' is the unique identifier for each customer. Therefore, we will join these two tables into one.

In [98]:
print("customer_id: " ,customer_df['customer_id'].unique().size)
print("customer_unique_id: ", customer_df['customer_unique_id'].unique().size)

customer_id:  99441
customer_unique_id:  96096

In [99]:
# Check if two columns from two tables are the same
temp_customer_df = customer_df['customer_id'].sort_values().reset_index()['customer_id'] 
temp_order_df = order_df['customer_id'].sort_values().reset_index()['customer_id']

(temp_customer_df == temp_order_df).sum()

99441

Description of each column (assumptions)

<table>
  <thead>
    <tr>
      <th>Column Name</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>customer_id</td>
      <td>Foreign key to link to customer table</td>
    </tr>
    <tr>
      <td>customer_unique_id </td>
      <td>Unique identifier for each customer</td>
    </tr>
    <tr>
      <td>customer_zip_code_prefix </td>
      <td>Zip code where the order is created</td>
    </tr>
    <tr>
      <td>customer_city </td>
      <td>City where the order is created</td>
    </tr>
    <tr>
      <td>customer_state</td>
      <td>State where the order is created</td>
    </tr>
  </tbody>
</table>

## Clean data

Join two tables

In [100]:
order_customer_df = order_df.merge(customer_df, how='inner', left_on = 'customer_id', right_on = 'customer_id')
order_customer_df.drop('customer_id', axis=1, inplace=True)

# Geological

## Inspect data

Import data

In [101]:
geological_df = pd.read_csv(data_loc + r"\olist_geolocation_dataset.csv")
geological_df.head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP

Overall information

In [102]:
geological_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000163 entries, 0 to 1000162
Data columns (total 5 columns):
 #   Column                       Non-Null Count    Dtype
---  ------                       --------------    -----
 0   geolocation_zip_code_prefix  1000163 non-null  int64
 1   geolocation_lat              1000163 non-null  float64
 2   geolocation_lng              1000163 non-null  float64
 3   geolocation_city             1000163 non-null  object
 4   geolocation_state            1000163 non-null  object
dtypes: float64(2), int64(1), object(2)
memory usage: 38.2+ MB

Check typos

In [103]:
temp_geo_df = geological_df[['geolocation_zip_code_prefix', 'geolocation_city', 'geolocation_state']].drop_duplicates()
temp_geo_df

         geolocation_zip_code_prefix      geolocation_city geolocation_state
0                               1037             sao paulo                SP
1                               1046             sao paulo                SP
3                               1041             sao paulo                SP
4                               1035             sao paulo                SP
5                               1012             são paulo                SP
...                              ...                   ...               ...
999806                         99940                ibiaçá                RS
999846                         99952  santa cecilia do sul                RS
999867                         99970               ciríaco                RS
999891                         99930               estação                RS
1000046                        99955          vila lângaro                RS

[27912 rows x 3 columns]

In [104]:
temp_geo_df.groupby('geolocation_zip_code_prefix').size().sort_values(ascending=False)

geolocation_zip_code_prefix
13457    5
78290    5
13455    5
13454    5
42850    5
        ..
38444    1
38445    1
38446    1
38447    1
99990    1
Length: 19015, dtype: int64

In [105]:
temp_geo_df[temp_geo_df['geolocation_zip_code_prefix'] == 78290]

        geolocation_zip_code_prefix       geolocation_city geolocation_state
822766                        78290  figueiropolis d'oeste                MT
822918                        78290  figueiropolis d oeste                MT
822941                        78290  figueirópolis d'oeste                MT
823374                        78290   figueirópolis doeste                MT
823440                        78290   figueiropolis doeste                MT

=> There are too many typos to be corrected. We will pass on it as it is not efficient to mend those datas

# Order Items

## Inspect data

Import data

In [106]:
order_item_df = pd.read_csv(data_loc + r"\olist_order_items_dataset.csv")
order_item_df

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14
...,...,...,...,...,...,...,...
112645,fffc94f6ce00a00581880bf54a75a037,1,4aa6014eceb682077f9dc4bffebc05b0,b8bc237ba3788b23da09c0f1f3a3288c,2018-05-02 04:11:01,299.99,43.41
112646,fffcd46ef2263f404302a634eb57f7eb,1,32e07fd915822b0765e448c4dd74c828,f3c38ab652836d21de61fb8314b69182,2018-07-20 04:31:48,350.00,36.53
112647,fffce4705a9662cd70adb13d4a31832d,1,72a30483855e2eafc67aee5dc2560482,c3cfdc648177fdbbbb35635a37472c53,2017-10-30 17:14:25,99.90,16.95
112648,fffe18544ffabc95dfada21779c9644f,1,9c422a519119dcad7575db5af1ba540e,2b3e4a2a3ea8e01938cabda2a3e5cc79,2017-08-21 00:04:32,55.99,8.72
112649,fffe41c64501cc87c801fd61db3f6244,1,350688d9dc1e75ff97be326363655e01,f7ccf836d21b2fb1de37564105216cc1,2018-06-12 17:10:13,43.00,12.79

Overall information

In [107]:
order_item_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 112650 entries, 0 to 112649
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   order_id             112650 non-null  object
 1   order_item_id        112650 non-null  int64
 2   product_id           112650 non-null  object
 3   seller_id            112650 non-null  object
 4   shipping_limit_date  112650 non-null  object
 5   price                112650 non-null  float64
 6   freight_value        112650 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 6.0+ MB

In [108]:
order_item_df.describe()

       order_item_id          price  freight_value
count  112650.000000  112650.000000  112650.000000
mean        1.197834     120.653739      19.990320
std         0.705124     183.633928      15.806405
min         1.000000       0.850000       0.000000
25%         1.000000      39.900000      13.080000
50%         1.000000      74.990000      16.260000
75%         1.000000     134.900000      21.150000
max        21.000000    6735.000000     409.680000

Description of each column (assumptions)

<table>
  <thead>
    <tr>
      <th>Column Name</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>order_id</td>
      <td>Unique identifier for each order</td>
    </tr>
    <tr>
      <td>order_item_id </td>
      <td>Unique identifier for each order item in an order as an increasing number</td>
    </tr>
    <tr>
      <td>product_id </td>
      <td>Unique identifier for each product</td>
    </tr>
    <tr>
      <td>seller_id </td>
      <td>Unique identifier for each seller</td>
    </tr>
    <tr>
      <td>shipping_limit_date</td>
      <td>Shipping limit date</td>
    </tr>
    <tr>
      <td>price</td>
      <td>Price of the item ordered</td>
    </tr>
    <tr>
      <td>freight_value</td>
      <td>Tranportation cost</td>
    </tr>
  </tbody>
</table>

# Order payment

## Inspect data

Import data

In [109]:
order_payment_df = pd.read_csv(data_loc + r"\olist_order_payments_dataset.csv")
order_payment_df

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45
...,...,...,...,...,...
103881,0406037ad97740d563a178ecc7a2075c,1,boleto,1,363.31
103882,7b905861d7c825891d6347454ea7863f,1,credit_card,2,96.80
103883,32609bbb3dd69b3c066a6860554a77bf,1,credit_card,1,47.77
103884,b8b61059626efa996a60be9bb9320e10,1,credit_card,5,369.54
103885,28bbae6599b09d39ca406b747b6632b1,1,boleto,1,191.58

Overall information

In [110]:
order_payment_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [111]:
order_payment_df.describe()

       payment_sequential  payment_installments  payment_value
count       103886.000000         103886.000000  103886.000000
mean             1.092679              2.853349     154.100380
std              0.706584              2.687051     217.494064
min              1.000000              0.000000       0.000000
25%              1.000000              1.000000      56.790000
50%              1.000000              1.000000     100.000000
75%              1.000000              4.000000     171.837500
max             29.000000             24.000000   13664.080000

Description of each column (assumptions)

<table>
  <thead>
    <tr>
      <th>Column Name</th>
      <th>Description</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>order_id</td>
      <td>Unique identifier for each order</td>
    </tr>
    <tr>
      <td>order_item_id </td>
      <td>Unique identifier for each order item in an order as an increasing number</td>
    </tr>
    <tr>
      <td>product_id </td>
      <td>Unique identifier for each product</td>
    </tr>
    <tr>
      <td>seller_id </td>
      <td>Unique identifier for each seller</td>
    </tr>
    <tr>
      <td>shipping_limit_date</td>
      <td>Shipping limit date</td>
    </tr>
    <tr>
      <td>price</td>
      <td>Price of the item ordered</td>
    </tr>
    <tr>
      <td>freight_value</td>
      <td>Tranportation cost</td>
    </tr>
  </tbody>
</table>

## Compare 'payment' vs 'price' + 'freight_value'

We will take the sum of payment as net sales

In [112]:
order_value_df = pd.concat([order_item_df['order_id'], order_item_df[['price', 'freight_value']].sum(axis=1)], axis=1)
order_value_df = order_value_df.groupby('order_id').sum()
order_value_df.columns = ['order_value']
order_value_df.head()

                                  order_value
order_id
00010242fe8c5a6d1ba2dd792cb16214        72.19
00018f77f2f0320c557190d7a144bdd3       259.83
000229ec398224ef6ca0657da4fc703e       216.87
00024acbcdf0a6daa1e931b038114c75        25.78
00042b26cf59d7ce69dfabb4e55b4fd9       218.04

In [113]:
payment_value_df =  order_payment_df.groupby('order_id').payment_value.sum()
payment_value_df = payment_value_df.to_frame()
payment_value_df.head()

                                  payment_value
order_id
00010242fe8c5a6d1ba2dd792cb16214          72.19
00018f77f2f0320c557190d7a144bdd3         259.83
000229ec398224ef6ca0657da4fc703e         216.87
00024acbcdf0a6daa1e931b038114c75          25.78
00042b26cf59d7ce69dfabb4e55b4fd9         218.04

In [114]:
value_df = payment_value_df.merge(order_value_df, how='left', left_on = 'order_id', right_on = 'order_id')
value_df.head()

                                  payment_value  order_value
order_id
00010242fe8c5a6d1ba2dd792cb16214          72.19        72.19
00018f77f2f0320c557190d7a144bdd3         259.83       259.83
000229ec398224ef6ca0657da4fc703e         216.87       216.87
00024acbcdf0a6daa1e931b038114c75          25.78        25.78
00042b26cf59d7ce69dfabb4e55b4fd9         218.04       218.04

In [115]:
value_df["payment_value"] = round(value_df["payment_value"],2) 
value_df["order_value"] = round(value_df["order_value"],2)

In [116]:
# Compare two values: only less than 1% erroneous data points
value_df[value_df['payment_value'] != value_df['order_value']]

                                  payment_value  order_value
order_id
0010dedd556712d7bb69a19cb7bbd37a         111.12          NaN
005d9a5423d47281ac463a968b3936fb         145.26       145.25
00789ce015e7e5791c7914f32bb4fad4         190.81       168.83
00a500bc03bc4ec968e574c2553bed4b         555.99          NaN
00b1cb0320190ca0daa2c88b35206009           0.00          NaN
...                                         ...          ...
fe87d4b944748f63ca5ed22cc55b6fb6         173.68          NaN
feae5ecdf2cc16c1007741be785fe3cd          68.53          NaN
fecb65750b4fe05b8257f650b2e114a2         216.75       216.76
ff71fa43cf5b726cd4a5763c7d819a35          81.89          NaN
ffb18bf111fa70edf316eb0390427986         617.24       617.25

[1351 rows x 2 columns]

# Order review

## Inspect data

Import data

In [117]:
order_review_df = pd.read_csv(data_loc + r"\olist_order_reviews_dataset.csv")
order_review_df

,review_id,order_id,review_score,review_comment_title,review_comment_message,review_creation_date,review_answer_timestamp
0,7bc2406110b926393aa56f80a40eba40,73fc7af87114b39712e6da79b0a377eb,4,NaN,NaN,2018-01-18 00:00:00,2018-01-18 21:46:59
1,80e641a11e56f04c1ad469d5645fdfde,a548910a1c6147796b98fdf73dbeba33,5,NaN,NaN,2018-03-10 00:00:00,2018-03-11 03:05:13
2,228ce5500dc1d8e020d8d1322874b6f0,f9e4b658b201a9f2ecdecbb34bed034b,5,NaN,NaN,2018-02-17 00:00:00,2018-02-18 14:36:24
3,e64fb393e7b32834bb789ff8bb30750e,658677c97b385a9be170737859d3511b,5,NaN,Recebi bem antes do prazo estipulado.,2017-04-21 00:00:00,2017-04-21 22:02:06
4,f7c4243c7fe1938f181bec41a392bdeb,8e6bfb81e283fa7e4f11123a3fb894f1,5,NaN,Parabéns lojas lannister adorei comprar pela I...,2018-03-01 00:00:00,2018-03-02 10:26:53
...,...,...,...,...,...,...,...
99995,f3897127253a9592a73be9bdfdf4ed7a,22ec9f0669f784db00fa86d035cf8602,5,NaN,NaN,2017-12-09 00:00:00,2017-12-11 20:06:42
99996,b3de70c89b1510c4cd3d0649fd302472,55d4004744368f5571d1f590031933e4,5,NaN,"Excelente mochila, entrega super rápida. Super...",2018-03-22 00:00:00,2018-03-23 09:10:43
99997,1adeb9d84d72fe4e337617733eb85149,7725825d039fc1f0ceb7635e3f7d9206,4,NaN,NaN,2018-07-01 00:00:00,2018-07-02 12:59:13
99998,be360f18f5df1e0541061c87021e6d93,f8bd3f2000c28c5342fedeb5e50f2e75,1,NaN,Solicitei a compra de uma capa de retrovisor c...,2017-12-15 00:00:00,2017-12-16 01:29:43
99999,efe49f1d6f951dd88b51e6ccd4cc548f,90531360ecb1eec2a1fbb265a0db0508,1,NaN,"meu produto chegou e ja tenho que devolver, po...",2017-07-03 00:00:00,2017-07-03 21:01:49

In [118]:
order_review_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   review_id                100000 non-null  object
 1   order_id                 100000 non-null  object
 2   review_score             100000 non-null  int64
 3   review_comment_title     11715 non-null   object
 4   review_comment_message   41753 non-null   object
 5   review_creation_date     100000 non-null  object
 6   review_answer_timestamp  100000 non-null  object
dtypes: int64(1), object(6)
memory usage: 5.3+ MB

# Product

## Inspect data

Import data

In [119]:
product_df = pd.read_csv(data_loc + r"\olist_products_dataset.csv")
product_df

,product_id,product_category_name,product_name_lenght,product_description_lenght,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1e9e8ef04dbcff4541ed26657ea517e5,perfumaria,40.0,287.0,1.0,225.0,16.0,10.0,14.0
1,3aa071139cb16b67ca9e5dea641aaa2f,artes,44.0,276.0,1.0,1000.0,30.0,18.0,20.0
2,96bd76ec8810374ed1b65e291975717f,esporte_lazer,46.0,250.0,1.0,154.0,18.0,9.0,15.0
3,cef67bcfe19066a932b7673e239eb23d,bebes,27.0,261.0,1.0,371.0,26.0,4.0,26.0
4,9dc1a7de274444849c219cff195d0b71,utilidades_domesticas,37.0,402.0,4.0,625.0,20.0,17.0,13.0
...,...,...,...,...,...,...,...,...,...
32946,a0b7d5a992ccda646f2d34e418fff5a0,moveis_decoracao,45.0,67.0,2.0,12300.0,40.0,40.0,40.0
32947,bf4538d88321d0fd4412a93c974510e6,construcao_ferramentas_iluminacao,41.0,971.0,1.0,1700.0,16.0,19.0,16.0
32948,9a7c6041fa9592d9d9ef6cfe62a71f8c,cama_mesa_banho,50.0,799.0,1.0,1400.0,27.0,7.0,27.0
32949,83808703fc0706a22e264b9d75f04a2e,informatica_acessorios,60.0,156.0,2.0,700.0,31.0,13.0,20.0
32950,106392145fca363410d287a815be6de4,cama_mesa_banho,58.0,309.0,1.0,2083.0,12.0,2.0,7.0

Overall information

In [120]:
product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32951 entries, 0 to 32950
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   product_id                  32951 non-null  object
 1   product_category_name       32341 non-null  object
 2   product_name_lenght         32341 non-null  float64
 3   product_description_lenght  32341 non-null  float64
 4   product_photos_qty          32341 non-null  float64
 5   product_weight_g            32949 non-null  float64
 6   product_length_cm           32949 non-null  float64
 7   product_height_cm           32949 non-null  float64
 8   product_width_cm            32949 non-null  float64
dtypes: float64(7), object(2)
memory usage: 2.3+ MB

## Clean data

Translate product category name using product_category_name_translation.csv

In [121]:
cat_name_trans = pd.read_csv(data_loc + r"\product_category_name_translation.csv")
cat_name_trans

            product_category_name product_category_name_english
0                    beleza_saude                 health_beauty
1          informatica_acessorios         computers_accessories
2                      automotivo                          auto
3                 cama_mesa_banho                bed_bath_table
4                moveis_decoracao               furniture_decor
..                            ...                           ...
66                         flores                       flowers
67             artes_e_artesanato         arts_and_craftmanship
68                fraldas_higiene           diapers_and_hygiene
69  fashion_roupa_infanto_juvenil     fashion_childrens_clothes
70             seguros_e_servicos         security_and_services

[71 rows x 2 columns]

In [122]:
product_df = product_df.merge(cat_name_trans, how='left', left_on='product_category_name', right_on='product_category_name')
product_df.drop('product_category_name', axis=1, inplace=True)
product_df['product_category_name_english'].fillna('other', inplace=True)

# Seller

## Inspect data

Import data

In [123]:
seller_df = pd.read_csv(data_loc + r"\olist_sellers_dataset.csv")
seller_df

,seller_id,seller_zip_code_prefix,seller_city,seller_state
0,3442f8959a84dea7ee197c632cb2df15,13023,campinas,SP
1,d1b65fc7debc3361ea86b5f14c68d2e2,13844,mogi guacu,SP
2,ce3ad9de960102d0677a81f5d0bb7b2d,20031,rio de janeiro,RJ
3,c0f3eea2e14555b6faeea3dd58c1b1c3,4195,sao paulo,SP
4,51a04a8a6bdcb23deccc82b0b80742cf,12914,braganca paulista,SP
...,...,...,...,...
3090,98dddbc4601dd4443ca174359b237166,87111,sarandi,PR
3091,f8201cab383e484733266d1906e2fdfa,88137,palhoca,SC
3092,74871d19219c7d518d0090283e03c137,4650,sao paulo,SP
3093,e603cf3fec55f8697c9059638d6c8eb5,96080,pelotas,RS
3094,9e25199f6ef7e7c347120ff175652c3b,12051,taubate,SP

Overall information

In [124]:
seller_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3095 entries, 0 to 3094
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   seller_id               3095 non-null   object
 1   seller_zip_code_prefix  3095 non-null   int64
 2   seller_city             3095 non-null   object
 3   seller_state            3095 non-null   object
dtypes: int64(1), object(3)
memory usage: 96.8+ KB

# Export processed data

In [125]:
processed_data_loc = loc + r'\processed_data'

In [126]:
order_customer_df.to_csv(processed_data_loc + r"\order_customer.csv", index=False)
order_item_df.to_csv(processed_data_loc + r"\item.csv", index=False) 
order_payment_df.to_csv(processed_data_loc + r"\payment.csv", index=False) 
order_review_df.to_csv(processed_data_loc + r"\review.csv", index=False)
product_df.to_csv(processed_data_loc + r"\product.csv", index=False)
seller_df.to_csv(processed_data_loc + r"\seller.csv", index=False)